rules = [
    {
        "title": "Артикль a/an",
        "body": (
            "Употребляется только с исчисляемыми именами существительными в единственном числе.\n"
            "a plate - тарелка\n"
            "an apple - яблоко"
        ),
        "image": "https://sun9-38.userapi.com/impg/M8J655pFjUvhQGrYrU7aQicpZyAIyznOT-Yiaw/o_v2eNs6Cec.jpg?size=1024x768&quality=95&sign=a3ce63eb9a0023f4a1b5cf76d2ad26f2&type=album",
        "tasks": [
            "Выберите правильный артикль (a или an) для слов: ___ cat, ___ orange, ___ book, ___ egg.",
            "Напишите 3 предложения с использованием артиклей a/an.",
            "Переведите на английский: 'яблоко', 'стол', 'утка', 'окно' с артиклями."
        ]
    },
    {
        "title": "Множественное число существительных",
        "body": (
            "К существительному добавляется окончание -s:\n"
            "cat - cats\n"
            "Если слово оканчивается на s, ss, ch, sh - окончание -es:\n"
            "match - matches"
        ),
        "image": "https://284baef4-3d14-4ca5-8247-4811f0d6b14b.selstorage.ru/76ad336c-a470-4424-a86d-7fd0fd072c76_flow-1747492899889.png",
        "tasks": [
            "Образуйте множественное число для слов: 'bus', 'fox', 'match', 'dog'.",
            "Напишите 3 предложения с существительными во множественном числе.",
            "Переведите на английский: 'столы', 'книги', 'часы', 'мыши'."
        ]
    },
    {
        "title": "Предлоги",
        "body": (
            "in - в (in the box - в коробке)\n"
            "on - на (on the box - на коробке)\n"
            "under - под (under the box - под коробкой)\n"
            "by - у, около (by the box - у коробки)"
        ),
        "image": "https://sun1-18.userapi.com/s/v1/ig2/V4hHmtu-xPW03_ucIrJ4dDY-QMLpIKnp44lHqnVKuvU-VxzRA5y5dlrBO_hPPElwps8P-23h2kLODvEXi91dwZZy.jpg?quality=95&as=32x9,48x14,72x20,108x31,160x46,240x68,360x103,480x137,540x154,640x182,720x205,913x260&from=bu&u=PDcSvk7nOod7ILWeLqfRjIX7jdr57Xgt2es62xuSh6M&cs=913x260",
        "tasks": [
            "Определите предлог в предложениях: 'The book is ___ the table.', 'The cat is ___ the box.'",
            "Составьте 4 предложения с предлогами in, on, under, by.",
            "Переведите на английский: 'книга на столе', 'кошка под стулом', 'мяч в коробке'."
        ]
    },
    {
        "title": "Глагол to be и его формы",
        "body": (
            "am - только с I (I am)\n"
            "are - только с you, we, they\n"
            "is - только с he, she, it\n"
            "I am a pupil. - Я ученик."
        ),
        "image": "https://284baef4-3d14-4ca5-8247-4811f0d6b14b.selstorage.ru/570f5dac-4b41-4f37-8274-50763aa4d7c8_flow-1747564611284.png",
        "tasks": [
            "Заполните пропуски: I ___ happy, She ___ my friend, They ___ at home.",
            "Составьте 3 предложения с разными формами глагола to be.",
            "Переведите на английский: 'Я учитель', 'Она дома', 'Мы друзья'."
        ]
    },
    {
        "title": "Общий вопрос и краткий ответ",
        "body": (
            "Общий вопрос: на первое место ставится вспомогательный глагол (или to be):\n"
            "Is he in the park? - Он в парке?\n"
            "Are they on the farm? - Они на ферме?\n"
            "Краткий ответ: Yes/No + местоимение + to be:\n"
            "Yes, he is. / No, they aren’t."
        ),
        "image": "https://284baef4-3d14-4ca5-8247-4811f0d6b14b.selstorage.ru/86cd6504-a6cd-4622-9130-b305a6ea8ee2_flow-1747573383919.png",
        "tasks": [
            "Составьте общий вопрос к предложению: 'She is at school.'",
            "Дайте краткий ответ на вопрос: 'Is it cold today?'",
            "Переведите на английский: 'Он дома?', 'Да, он дома.', 'Нет, их нет.'"
        ]
    },
    {
        "title": "Время",
        "body": (
            "What’s the time? - Который час?\n"
            "It's [hour] o'clock - ровно час.\n"
            "It's [minutes] past [hour] - минут после часа (до 30).\n"
            "It's [minutes] to [next hour] - минут до часа (больше 30)."
        ),
        "image": "https://284baef4-3d14-4ca5-8247-4811f0d6b14b.selstorage.ru/57547111-1b28-46e9-b070-ee64e815adc8_flow-1747575072004.png",
        "tasks": [
            "Ответьте на вопрос: What’s the time? используя часы и минуты.",
            "Составьте 3 предложения с указанием времени на английском.",
            "Переведите на английский: 'Сейчас два часа', 'Половина третьего', 'Без пятнадцати семь'."
        ]
    },
    {
        "title": "Полезные фразы",
        "body": (
            "Hello! - Привет!\n"
            "How are you? - Как дела?\n"
            "I’m fine! - Хорошо!\n"
            "What’s your name? - Как тебя зовут?\n"
            "My name is… - Меня зовут…"
        ),
        "image": "https://fsd.multiurok.ru/html/2019/06/24/s_5d105bb9dc6e7/img_s1177645_0_10.jpg",
        "tasks": [
            "Составьте диалог из 3 реплик, используя данные фразы.",
            "Переведите на английский: 'Привет! Как тебя зовут?', 'Меня зовут Анна. Как дела?'.",
            "Напишите 3 предложения с приветствиями и вопросами о самочувствии."
        ]
    }
]
